const UserService = require('../service/userService');

class UserController {
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    async registration(req, res, next) {
        try {
            //Дастаем данные из тела запроса
            const {email, password} = req.body;

            //Регистрируем нового пользователя с помощью сервиса регистарции пользователей
            const userData = await UserService.registration(email, password);

            //Помещаем refreshToken в cookie и задаем ему параметры жизни 30 дней и флаг,
            //который не позволяет изменять куку на стороне клиента с помощью JS
            res.cookie('refreshToken', userData.refreshToken, { httpOnly: true, maxAge: 30 * 24 * 60 * 60 * 1000 })

            //Отправляем данные на сервер со статусом 200 и данными полученными из сервиса
            return res.status(200).json(userData);
        }catch (e){
            console.log(e);
        }
    }
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    async login(req, res, next) {
        try {

        }catch (e){

        }
    }
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    async logout(req, res, next) {
        try {

        }catch (e){

        }
    }
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    async activate(req, res, next) {
        try {

        }catch (e){

        }
    }
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    async refresh(req, res, next) {
        try {

        }catch (e){

        }
    }
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    async getUsers(req, res, next) {
        try {

        }catch (e){

        }
    }

}

module.exports = new UserController();